proys/despachos/front/back/app/Controllers/Api/V1/UserController.php

SELECT *
FROM `users`
WHERE `userEmail` = 'samu.silva@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function signIn()
    {

        $payload = $this->request->getJSON();

        //load from database user based on userEmail

        $user = $this->model->where('userEmail', $payload->userEmail)->first();